app/controllers/answers_controller.rb

  def index
    @answers = Answer.all
    @a_questions = Question.all
---
SELECT "answers".* FROM "answers"
SELECT "questions".* FROM "questions"

  def show
    @a_questions = Question.all
---
SELECT "questions".* FROM "questions"

  def new
    @answer = Answer.new
     @a_questions = Question.order('id ASC')
---
SELECT "questions".* FROM "questions"  ORDER BY id ASC

  def create
    @answer = Answer.new(answer_params)

    respond_to do |format|
      if @answer.save
---
INSERT INTO "answers" ("question_id", "tru", "falce_1", "falce_2", "falce_3", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["question_id", 1], ["tru", "4"], ["falce_1", "1"], ["falce_2", "5"], ["falce_3", "3"], ["created_at", "2015-08-03 22:05:18.867072"], ["updated_at", "2015-08-03 22:05:18.867072"]]