app/controllers/questions_controller.rb

  def new
    @question = Question.new
    @users = User.order('id ASC')
---
SELECT "users".* FROM "users"  ORDER BY id ASC

  def create
    @question = Question.new(question_params)
    @users = User.all


    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("question", "level", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question", "sa bajn 2 + 2"], ["level", "1"], ["user_id", 1], ["created_at", "2015-08-03 21:35:44.780014"], ["updated_at", "2015-08-03 21:35:44.780014"]]

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE "questions" SET "question" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["question", "sa bajn 2 + 2?"], ["updated_at", "2015-08-03 21:35:59.458883"], ["id", 1]]

    def set_question
      @question = Question.find(params[:id])
      @users = User.all
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"