app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)